---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesDeleted
source: html/ecf0a97a-e674-152a-3f5b-f300dcbb983a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesDeleted Property

Some slab shape edit vertices were deleted because the Floor or Roof or Toposolid has changed its shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlabShapeWarnVerticesDeleted { get; }
```